ХМНПФ_Общее/DataProcessors/уп_ИндексацияСрочныхПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ИндексацияСрочныхПенсий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СхемаСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СхемаСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_СчетчикНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СчетчикНачислений</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/хм_СрезСчетчикНачисленийНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>хм_СрезСчетчикНачисленийНПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_КоличествоНазначенныхВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_КоличествоНазначенныхВыплат</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_РазмерПенсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РазмерПенсии</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолныйРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыПенсионныхСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыПенсионныхСхем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрочныхВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПожизненныхВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоИсчерпанияСредствНаСчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_ИндексацияСрочныхПенсий/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("СформироватьНаСервере")
Процедура ХМСформироватьНаСервере()
	       
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_СостоянияПССрезПоследних.НомерСчета КАК НомерСчета
		|ПОМЕСТИТЬ вр_ТабВыплатныеСчета
		|ИЗ
		|	РегистрСведений.уп_СостоянияПС.СрезПоследних(&Дата, ) КАК уп_СостоянияПССрезПоследних
		|ГДЕ
		|	уп_СостоянияПССрезПоследних.Состояние В(&СписокВыплатных)
		|	И уп_СостоянияПССрезПоследних.НомерСчета.Владелец.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_СхемаСчетаСрезПоследних.НомерСчета КАК НомерСчета
		|ПОМЕСТИТЬ вр_ПенсСчета
		|ИЗ
		|	РегистрСведений.уп_СхемаСчета.СрезПоследних(
		|			&Дата,
		|			НомерСчета В
		|					(ВЫБРАТЬ
		|						вр_ТабВыплатныеСчета.НомерСчета КАК НомерСчета
		|					ИЗ
		|						вр_ТабВыплатныеСчета КАК вр_ТабВыплатныеСчета)
		|				И (Схема.ТипПенсионнойСхемы = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.СрочныхВыплат)
		|					ИЛИ ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.СрочныхВыплат))
		|				И Схема.ФиксированныеВыплаты) КАК уп_СхемаСчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
#Вставка
//++https://redmine.npf.com/issues/4274
	|ВЫБРАТЬ
	|	уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|	СУММА(уп_СчетчикНачислений.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ уп_СчетчикНачисленийОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|		уп_СчетчикНачислений.Количество КАК КоличествоОборот
	|	ИЗ
	|		РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&Дата, НомерСчета В (ВЫБРАТЬ
	|						вр_ПенсСчета.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ПенсСчета КАК вр_ПенсСчета)) КАК хм_СрезСчетчик
	|			ПО уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета
	|				И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния
	|	ГДЕ
	|		уп_СчетчикНачислений.Период <= &Дата
	|	    И уп_СчетчикНачислений.НомерСчета В (ВЫБРАТЬ
	|						вр_ПенсСчета.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ПенсСчета КАК вр_ПенсСчета)
	|		И хм_СрезСчетчик.ДатаУстановкиСостояния ЕСТЬ NULL
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		хм_СрезСчетчик.НомерСчета,
	|		хм_СрезСчетчик.Количество
	|	ИЗ
	|		РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&Дата, НомерСчета В (ВЫБРАТЬ
	|						вр_ПенсСчета.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ПенсСчета КАК вр_ПенсСчета)) КАК хм_СрезСчетчик
	|
	|) КАК уп_СчетчикНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_СчетчикНачислений.НомерСчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
	|;
//--https://redmine.npf.com/issues/4274
#КонецВставки
		|ВЫБРАТЬ
		|	вр_ПенсСчета.НомерСчета КАК НомерСчета,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(уп_КоличествоНазначенныхВыплатСрезПоследних.КоличествоВыплат, 0) - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) > 0
		|			ТОГДА (ЕСТЬNULL(уп_РезервыОстатки.СуммаОстаток, 0) - ЕСТЬNULL(уп_ПоступленияКПерерасчетуОстатки.СуммаОстаток, 0)) / (ЕСТЬNULL(уп_КоличествоНазначенныхВыплатСрезПоследних.КоличествоВыплат, 0) - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сумма,
		|	ЕСТЬNULL(уп_РазмерПенсииСрезПоследних.Размер, 0) КАК РазмерПенсии,
		|	вр_ПенсСчета.НомерСчета.Участник КАК Участник,
		|	вр_ПенсСчета.НомерСчета.Владелец КАК ПенсионныйДоговор
		|ИЗ
		|	вр_ПенсСчета КАК вр_ПенсСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_Резервы.Остатки(
		|				&Дата,
		|				НомерСчета В
		|						(ВЫБРАТЬ
		|							вр_ПенсСчета.НомерСчета КАК НомерСчета
		|						ИЗ
		|							вр_ПенсСчета КАК вр_ПенсСчета)
		|					И НЕ ТипРезерва В (&РезервыНачислений)) КАК уп_РезервыОстатки
		|		ПО вр_ПенсСчета.НомерСчета = уп_РезервыОстатки.НомерСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_КоличествоНазначенныхВыплат.СрезПоследних(
		|				&Дата,
		|				НомерСчета В
		|					(ВЫБРАТЬ
		|						вр_ПенсСчета.НомерСчета КАК НомерСчета
		|					ИЗ
		|						вр_ПенсСчета КАК вр_ПенсСчета)) КАК уп_КоличествоНазначенныхВыплатСрезПоследних
		|		ПО вр_ПенсСчета.НомерСчета = уп_КоличествоНазначенныхВыплатСрезПоследних.НомерСчета
#Вставка
//++https://redmine.npf.com/issues/4274
	|		ЛЕВОЕ СОЕДИНЕНИЕ уп_СчетчикНачисленийОбороты КАК уп_СчетчикНачисленийОбороты
//--https://redmine.npf.com/issues/4274
#КонецВставки
#Удаление
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_СчетчикНачислений.Обороты(
		|				,
		|				&Дата,
		|				,
		|				НомерСчета В
		|					(ВЫБРАТЬ
		|						вр_ПенсСчета.НомерСчета КАК НомерСчета
		|					ИЗ
		|						вр_ПенсСчета КАК вр_ПенсСчета)) КАК уп_СчетчикНачисленийОбороты
#КонецУдаления
		|		ПО вр_ПенсСчета.НомерСчета = уп_СчетчикНачисленийОбороты.НомерСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_РазмерПенсии.СрезПоследних(
		|				&Дата,
		|				НомерСчета В
		|					(ВЫБРАТЬ
		|						вр_ПенсСчета.НомерСчета КАК НомерСчета
		|					ИЗ
		|						вр_ПенсСчета КАК вр_ПенсСчета)) КАК уп_РазмерПенсииСрезПоследних
		|		ПО вр_ПенсСчета.НомерСчета = уп_РазмерПенсииСрезПоследних.НомерСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ПоступленияКПерерасчету.Остатки(
		|				&Дата,
		|				НомерСчета В
		|					(ВЫБРАТЬ
		|						вр_ПенсСчета.НомерСчета КАК НомерСчета
		|					ИЗ
		|						вр_ПенсСчета КАК вр_ПенсСчета)) КАК уп_ПоступленияКПерерасчетуОстатки
		|		ПО вр_ПенсСчета.НомерСчета = уп_ПоступленияКПерерасчетуОстатки.НомерСчета
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ЕСТЬNULL(уп_КоличествоНазначенныхВыплатСрезПоследних.КоличествоВыплат, 0) - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) > 0
		|				ТОГДА ЕСТЬNULL(уп_РезервыОстатки.СуммаОстаток, 0) / (ЕСТЬNULL(уп_КоличествоНазначенныхВыплатСрезПоследних.КоличествоВыплат, 0) - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0))
		|			ИНАЧЕ 0
		|		КОНЕЦ > ЕСТЬNULL(уп_РазмерПенсииСрезПоследних.Размер, 0)";
	
	//Если ЗначениеЗаполнено(Объект.Организация) Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборОрганизация%", "И уп_СостоянияПССрезПоследних.НомерСчета.Владелец.Организация = &Организация");
	//Иначе
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборОрганизация%", "");
	//КонецЕсли;
	СписокВыплатных = Новый СписокЗначений;
	СписокВыплатных.Добавить(Перечисления.уп_СостоянияПС.ВыплатнойПериод);
	Если ВключатьВРасчетПриостановленныеПС Тогда 
		СписокВыплатных.Добавить(Перечисления.уп_СостоянияПС.НачисленияПриостановлены);
	КонецЕсли;	
	Запрос.УстановитьПараметр("СписокВыплатных", СписокВыплатных);
	Запрос.УстановитьПараметр("Дата", Объект.ДатаФормированияДокументов);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	РезервыНачислений = Новый Массив;
	РезервыНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммИПС);
	РезервыНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммПожизненныхВыплат);
	РезервыНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммСПС);
	РезервыНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийНаследниковИПС);
	РезервыНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийНаследниковСПС);
	РезервыНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийИПС);
	РезервыНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийПожизненныхВыплат);
	РезервыНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийСПС);
	Запрос.УстановитьПараметр("РезервыНачислений", РезервыНачислений); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Счетчик = 0;
	КолСтрокВТаблице = 20000;
	
	ТабСчетов = Новый ТаблицаЗначений;
	ТабСчетов.Колонки.Добавить("НомерСчета");
	ТабСчетов.Колонки.Добавить("Участник");
	ТабСчетов.Колонки.Добавить("ПенсионныйДоговор");
	ТабСчетов.Колонки.Добавить("Сумма");
	
	Пока Выборка.Следующий() Цикл
		Если Счетчик = КолСтрокВТаблице Тогда
			НоваяСтрока = Объект.НовыеДокументы.Добавить();
			НоваяСтрока.Документ = СформироватьДокументИндексации(ТабСчетов);
			Счетчик = 0;
			ТабСчетов.Очистить();
		КонецЕсли;	
		Счетчик = Счетчик + 1;
		НовСтр = ТабСчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
	КонецЦикла;	
	
	Если ТабСчетов.Количество() > 0 Тогда
		НоваяСтрока = Объект.НовыеДокументы.Добавить();
		НоваяСтрока.Документ = СформироватьДокументИндексации(ТабСчетов);
	КонецЕсли;
	
КонецПроцедуры
